## Задание 13

### Основные  понятия
- **IP-адрес** - уникальный адрес устройства в сети.
- **Маска** - определяет, какие части IP-адреса относятся к сети.
- **Сеть** - группа устройств, объединенных в одну сеть.
- **Широковещательный адрес** - адрес, который используется для отправки сообщения всем устройствам в сети.

### Определение адреса сети (Host)
> <code>Host = Mask & IP</code>

### Определение кол-ва хостов в сети
> Чтобы найти кол-во адресов в сети, необходимо 2 возвести в степень кол-ва нулей в маске и вычесть 2 (1-й адрес - это адрес сети, последний адрес - широковещательный).

Пример решения задания программированием (при сложных условиях)
```python
'''
Сеть задана IP-адресом 172.16.168.0 и маской сети 255.255.248.0.
Сколько в этой сети IP-адресов, для которых количество единиц в двоичной записи IP-адреса не кратно 5?
В ответе укажите только число
'''
from ipaddress import ip_network

count = 0
for ip in ip_network('172.16.168.0/255.255.248.0', False):
    if f'{ip:b}'.count('1') % 5 != 0:
        count += 1
print(count)
```

### Значения байт маски

<table class="docutils align-default">
    <tbody>
        <tr class="row-even">
            <td><code><span>1000 0000</span></code></td>
            <td><code>128</code></td>
        </tr>
        <tr class="row-even">
            <td><code><span>1100 0000</span></code></td>
            <td><code>192</code></td>
        </tr>
        <tr class="row-even">
            <td><code><span>1110 0000</span></code></td>
            <td><code>224</code></td>
        </tr>
        <tr class="row-even">
            <td><code><span>1111 0000</span></code></td>
            <td><code>240</code></td>
        </tr>
        <tr class="row-even">
            <td><code><span>1111 1000</span></code></td>
            <td><code>248</code></td>
        </tr>
        <tr class="row-even">
            <td><code><span>1111 1100</span></code></td>
            <td><code>252</code></td>
        </tr>
        <tr class="row-even">
            <td><code><span>1111 1110</span></code></td>
            <td><code>254</code></td>
        </tr>
        <tr class="row-even">
            <td><code><span>1111 1111</span></code></td>
            <td><code>255</code></td>
        </tr>
    </tbody>
</table>